[
  {
    "name": "",
    "notes": [
      "[Fixed] Surface again Git's warning about unsafe directories and provide a way to trust repositories not owned by the current user"
    ],
    "pub_date": "2022-07-14T09:25:29Z",
    "version": "3.0.5"
  },
  {
    "name": "",
    "notes": [
      "[Improved] Upgrade embedded Git to 2.35.4"
    ],
    "pub_date": "2022-07-13T08:23:03Z",
    "version": "3.0.4"
  },
  {
    "name": "",
    "notes": [
      "[Added] Add Aptana Studio support - #14669. Thanks @tsvetilian-ty!",
      "[Fixed] Fix crash when user's locale is unsupported by the spellchecker - #14817. Thanks @tsvetilian-ty!",
      "[Fixed] On Windows, remember the app's zoom level on update - #5315",
      "[Fixed] Fix Markdown syntax highlighting - #14710",
      "[Improved] Add context menu option to copy repository paths - #14785. Thanks @novialriptide!",
      "[Improved] Allow copying paths when multiple files are selected - #14638. Thanks @tsvetilian-ty!",
      "[Improved] Add support for SSH password prompts when accessing repositories - #14676"
    ],
    "pub_date": "2022-06-27T09:53:23Z",
    "version": "3.0.3"
  },
  {
    "name": "",
    "notes": [
      "[Fixed] Fix crash launching the app on macOS High Sierra - #14712",
      "[Fixed] Terminate all GitHub Desktop processes on Windows when the app is closed - #14733. Thanks @tsvetilian-ty!"
    ],
    "pub_date": "2022-06-13T09:38:05Z",
    "version": "3.0.2"
  },
  {
    "name": "",
    "notes": [
      "[Added] Add support for PyCharm Community Edition on Windows - #14411. Thanks @tsvetilian-ty!",
      "[Added] Add support for highlighting .mjs/.cjs/.mts/.cts files as JavaScript/TypeScript - #14481. Thanks @j-f1!",
      "[Fixed] Prevent crash when encountering a large number of conflicts while checking for ability to merge branch - #14485",
      "[Fixed] Url encode branch names when 'Viewing Branch in Github' is selected - #14631. Thanks @tsvetilian-ty!",
      "[Fixed] Fix opening files with Android Studio - #14519",
      "[Fixed] Checks popover summary correctly reflects a successful conclusion when skipped or neutral checks are present - #14508",
      "[Fixed] Long lists of conflicted files to commit or files to discard can be scrolled - #14468",
      "[Fixed] Fix random crashes when external apps probe GitHub Desktop trampoline port - #14471",
      "[Improved] Display a banner when we have a pretext release note to highlight the new feature - #14620",
      "[Improved] Enable interactions with notifications from previous app sessions - #14496",
      "[Improved] Improve feedback about user permission to display notifications - #14496",
      "[Improved] Add ability to have showcasing of features through release notes - #14488",
      "[Improved] User can see all releases notes between their current version and the latest update - #14458",
      "[Removed] Outdated new drag and drop and split diff new feature callouts removed - #14463"
    ],
    "pub_date": "2022-06-01T08:37:38Z",
    "version": "3.0.1"
  },
  {
    "name": "",
    "notes": [
      "[New] Get notified when your pull requests are reviewed - #14175",
      "[Fixed] Default to merging when pulling without a configured preference between merge or rebase - #14431",
      "[Improved] Add ability to re-run individual and failed GitHub Action checks - #14310"
    ],
    "pub_date": "2022-04-26T08:37:05Z",
    "version": "3.0.0"
  },
  {
    "name": "",
    "notes": [
      "[Fixed] Support trusting repositories on network shares (Windows) - #14368",
      "[Improved] Redesigned dialog for re-running checks - #14322"
    ],
    "pub_date": "2022-04-20T11:01:33Z",
    "version": "2.9.15"
  },
  {
    "name": "",
    "notes": [
      "[Improved] Surface Git's warning about unsafe directories and provide a way to trust repositories not owned by the current user - #14336"
    ],
    "pub_date": "2022-04-13T20:26:28Z",
    "version": "2.9.14"
  },
  {
    "name": "",
    "notes": [
      "[Added] Add ability to include or exclude multiple selected files for a commit from the context menu - #7790. Thanks @tsvetilian-ty!",
      "[Added] Add \"View Branch on GitHub\" to the branches menu - #14224. Thanks @tsvetilian-ty!",
      "[Fixed] Fix CI check status popover not closing when clicking on PR badge - #14256",
      "[Fixed] Fix checks list overflow handling on re-run checks dialog - #14246",
      "[Fixed] Pull requests adhere to temporal laws again - #14238",
      "[Fixed] Fix repository group header overflow when text is too long - #14233. Thanks @tsvetilian-ty!",
      "[Fixed] Clone dialog \"Choose\" button uses an open dialog for directory selection on Windows - #12812",
      "[Improved] Add a link under \"Enable notifications\" settings to the user's OS system notification settings - #14288"
    ],
    "pub_date": "2022-04-13T07:30:56Z",
    "version": "2.9.13"
  },
  {
    "name": "",
    "notes": [
      "[Added] Add support for Brackets Editor on Windows - #14069. Thanks @tsvetilian-ty!",
      "[Added] Add support for JetBrains RubyMine on Windows - #14068. Thanks @tsvetilian-ty!",
      "[Added] Add support for JetBrains GoLand on Windows - #14085. Thanks @tsvetilian-ty!",
      "[Added] Add support for Android Studio on Windows - #14054. Thanks @detherminal!",
      "[Fixed] Escape special characters when adding a file to .gitignore - #10253. Thanks @uttiya10!",
      "[Fixed] Show warning when attempting to commit files exceeding 100 MiB - #14164",
      "[Fixed] Allow selecting emojis in commit text - #14111",
      "[Fixed] Merge dialog options dropdown does not cause dialog scrolling - #13944",
      "[Fixed] Usernames displayed in repository list respect username casing - #9890",
      "[Fixed] Coauthor doesn't steal input focus while inputting commit message in squashing dialog - #13850",
      "[Fixed] Repository path validation for adding a repository doesn't erase keystrokes - #13901",
      "[Fixed] Command Line Tool ignores command aliases set by user on macOS - #13935",
      "[Improved] Relative time formatting consistent with dotcom - #14149",
      "[Improved] Prompt to initialize Git LFS cannot be dismissed by clicking outside of it - #14131",
      "[Improved] Add link to open fork settings when creating new branch on a forked repository - #12534. Thanks @geophilusd!",
      "[Improved] Render native elements such as scrollbars and checkboxes as dark when using a dark theme - #11174. Thanks @rakleed!"
    ],
    "pub_date": "2022-03-23T10:03:47Z",
    "version": "2.9.12"
  }
]
